In [1]:
import json
import pandas as pd
import numpy as np

In [2]:
korea = pd.read_csv('./source/전국 모든 업종.csv',sep=',',encoding='utf8')
del korea['Unnamed: 0']
korea.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,20173815,황진이,NaN,Q,음식,Q09,유흥주점,Q09A10,룸살롱/단란주점,I56211,...,4213010100102030001000001,NaN,강원도 원주시 중앙로 61,220904.0,26429.0,NaN,1,NaN,127.952252,37.347773

# 햄버거 상호코드 Q07을 알아내기 위해 처음부터 시작함
- 상호코드를 알아낸 이후에는 바로 고유 ID로

In [3]:
korea[['상호명','상권업종중분류코드']][korea.상호명.str.find('버거') >= 0]

                상호명 상권업종중분류코드
12          버거킹오션월드       Q07
9860          송탄햄버거       Q07
15499        버거225℃       Q07
15517    케이오십오수제햄버거       Q07
15879          버거타운       Q07
...             ...       ...
2557105     프랭크수제버거       Q06
2558024       랭고스버거       Q07
2558025       브룩스버거       Q07
2558166         버거샵       Q07
2559257       앵그리버거       Q07

[2576 rows x 2 columns]

In [2]:
burger = pd.read_csv('./source/고유 ID 버거.csv',sep=',',encoding='utf8')
del burger['Unnamed: 0']
burger['상호명'] = burger['상호명'].str.lower()
burger.head()

       상호명  지점명                도로명주소          경도         위도  ID
0  버거킹오션월드  NaN  강원도 홍천군 서면 한치골길 262  127.687273  37.652324  홍천
1      로데오  NaN   강원도 강릉시 경강로 2090-1  128.895743  37.754245  강릉
2   왕눈이도넛츠  NaN   강원도 영월군 영월읍 삼옥재길 2  128.476234  37.209981  영월
3  씨지브이원주2  NaN     강원도 원주시 서원대로 171  127.930798  37.344816  원주
4   베스킨라벤스  NaN       강원도 삼척시 진주로 35  129.163718  37.443797  삼척

# 1. 버거킹

In [3]:
king_kr1 = burger[burger['상호명'].str.find('버거킹') >= 0]
king_kr1.shape

(451, 6)

In [4]:
king_en1 = burger[burger['상호명'].str.find('burger king') >= 0]
king_en1.shape

(0, 6)

In [5]:
king = pd.concat([king_kr1,king_en1])
king_count = pd.pivot_table(data = king,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
king_count.rename(columns={
    '상호명':'버거킹'
},inplace=True)
king_count.reset_index(inplace=True)
king_count

        ID  버거킹
0       강릉    1
1       거제    4
2       경산    4
3       경주    1
4    고양 덕양    3
..     ...  ...
131  포항 북구    2
132     하남    2
133     홍성    1
134     홍천    4
135     화성    5

[136 rows x 2 columns]

# 2. 맥도날드

In [6]:
mac_kr1 = burger[burger['상호명'].str.find('맥도날드') >= 0]
mac_kr1.shape

(655, 6)

In [7]:
mac_kr2 = burger[burger['상호명'].str.find('맥도널드') >= 0]
mac_kr2.shape

(3, 6)

In [8]:
mac_en1 = burger[burger['상호명'].str.find('Mcdonald') >= 0]
mac_en1.shape

(0, 6)

In [9]:
mac = pd.concat([mac_kr1,mac_kr2,mac_en1])
mac_count = pd.pivot_table(data = mac,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
mac_count.rename(columns={
    '상호명':'맥도날드'
},inplace=True)
mac_count.reset_index(inplace=True)
mac_count

         ID  맥도날드
0        강릉     1
1        거제     3
2        경주     4
3     고양 덕양     8
4    고양 일산동     8
..      ...   ...
149   포항 남구     3
150   포항 북구     6
151      하남     1
152      홍성     2
153      화성     6

[154 rows x 2 columns]

# 3. 롯데리아

In [10]:
lot_kr1 = burger[burger['상호명'].str.find('롯데리아') >= 0]
lot_kr1.shape

(1123, 6)

In [11]:
lot_en1 = burger[burger['상호명'].str.find('lotte') >= 0]
lot_en1.shape

(0, 6)

In [12]:
lot_count = pd.pivot_table(data = lot_kr1,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
lot_count.rename(columns={
    '상호명':'롯데리아'
},inplace=True)
lot_count.reset_index(inplace=True)
lot_count

     ID  롯데리아
0    가평     4
1    강릉     5
2    강진     1
3    거제     4
4    거창     2
..   ..   ...
213  홍성     1
214  홍천     3
215  화성    18
216  화천     2
217  횡성     1

[218 rows x 2 columns]

# 4. KFC

In [13]:
kfc_kr1 = burger[burger['상호명'].str.find('케이에프') >= 0]
kfc_kr1.shape

(44, 6)

In [14]:
kfc_en1 = burger[burger['상호명'].str.find('kfc') >= 0]
kfc_en1.shape

(173, 6)

In [15]:
kfc = pd.concat([kfc_kr1,kfc_en1])
kfc_count = pd.pivot_table(data = kfc,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
kfc_count.rename(columns={
    '상호명':'KFC'
},inplace=True)
kfc_count.reset_index(inplace=True)
kfc_count

        ID  KFC
0       경산    2
1       경주    1
2    고양 덕양    2
3   고양 일산동    3
4   고양 일산서    2
..     ...  ...
86   포항 남구    1
87   포항 북구    2
88      하남    2
89      화성    1
90      횡성    1

[91 rows x 2 columns]

# 5. 맘스터치

In [16]:
touch_kr1 = burger[burger['상호명'].str.find('맘스터치') >= 0]
touch_kr1.shape

(298, 6)

In [17]:
touch_en1 = burger[burger['상호명'].str.find('touch') >= 0]
touch_en1.shape

(2, 6)

In [18]:
touch = pd.concat([touch_kr1,touch_en1])
touch_count = pd.pivot_table(data = touch,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
touch_count.rename(columns={
    '상호명':'맘스터치'
},inplace=True)
touch_count.reset_index(inplace=True)
touch_count

     ID  맘스터치
0    가평     1
1    강릉     4
2    거제     2
3    경산     3
4    경주     3
..   ..   ...
143  해남     1
144  홍성     1
145  홍천     1
146  화성     3
147  화천     3

[148 rows x 2 columns]

# 여러개의 DF을 한 번에 Join하기
- 이 방식은 행 이름이 중복되어서 들어감... 행 이름 바꿀 때 문제발생

In [19]:
from functools import reduce
dfs = [king_count, mac_count, lot_count, kfc_count, touch_count]
# on = 'ID' 으로만 하면 교집합이 되어 버려서 몇 도시가 탈락된다.
bugger_index = reduce(lambda left, right: pd.merge(left, right, how='outer', on='ID'), dfs)
bugger_index = bugger_index.fillna(0)
bugger_index.fillna(0,inplace=True)

In [20]:
bugger_index['버거지수'] = np.round((bugger_index['버거킹'] + bugger_index['맥도날드']) + bugger_index['KFC'] / (bugger_index['롯데리아'] + bugger_index['맘스터치']),2)

# 무한대 처리
- 이디야, 빽다방이 하나도 없는 지역은 0으로 나누었기 때문에 값이 inf로 나온다.
- 무한대 값 inf는 np.inf로

In [21]:
bugger_index[bugger_index['버거지수']==np.inf]

     ID  버거킹  맥도날드  롯데리아  KFC  맘스터치  버거지수
141  동해  0.0   3.0   0.0  1.0   0.0   inf

In [22]:
# np.inf, -np.inf값을 np.nan으로 바꾼 후 평균값으로 대체
bugger_index = bugger_index.replace([np.inf, -np.inf],np.nan)
bugger_index = bugger_index.fillna(bugger_index['버거지수'].mean())

In [23]:
bugger_index[bugger_index.index == '동해']

Empty DataFrame
Columns: [ID, 버거킹, 맥도날드, 롯데리아, KFC, 맘스터치, 버거지수]
Index: []

# 인구대비 계산을 위해 인구데이터 추가

In [24]:
pop = pd.read_csv('./source/소멸 위기 지역.csv',sep=',',encoding='utf8')
del pop['Unnamed: 0']
pop.head()

,광역시도,시도,20~39세계,20~39세여자,65세 이상계,인구수계,인구수남자,인구수여자,소멸 비율,소멸 위기 지역,ID
0,강원,강릉시,46008,20993,40497,203057,101154,101903,0.518384,False,강릉
1,강원,고성군,4006,1699,7005,23621,11933,11688,0.242541,True,고성(강원)
2,강원,동해시,16311,7510,16152,83888,42093,41795,0.464958,True,동해
3,강원,삼척시,12428,5280,14953,61833,31630,30203,0.353106,True,삼척
4,강원,속초시,15928,7411,14010,76302,37488,38814,0.528979,False,속초

In [25]:
buggerpop = pd.merge(bugger_index, pop[['ID','인구수계']], how='outer', on='ID')
buggerpop.set_index('ID',inplace=True)
buggerpop.fillna(0,inplace=True)
buggerpop

       버거킹  맥도날드  롯데리아  KFC  맘스터치   버거지수      인구수계
ID
강릉     1.0   1.0   5.0  0.0   4.0   2.00  203057.0
거제     4.0   3.0   4.0  0.0   2.0   7.00  232585.0
경산     4.0   0.0   8.0  2.0   3.0   4.18  255939.0
경주     1.0   4.0   8.0  1.0   3.0   5.09  239382.0
고양 덕양  3.0   8.0   9.0  2.0   2.0  11.18  434496.0
...    ...   ...   ...  ...   ...    ...       ...
임실     0.0   0.0   0.0  0.0   0.0   0.00   25064.0
청양     0.0   0.0   0.0  0.0   0.0   0.00   28735.0
태안     0.0   0.0   0.0  0.0   0.0   0.00   57081.0
단양     0.0   0.0   0.0  0.0   0.0   0.00   26478.0
영동     0.0   0.0   0.0  0.0   0.0   0.00   44563.0

[252 rows x 7 columns]

# 경계선(x축,y축 추가)

In [26]:
korea = pd.read_excel('./source/전국 카토그램.xlsx',engine='openpyxl')
korea_stacked = pd.DataFrame(korea.stack())
korea_stacked.reset_index(inplace=True)
korea_stacked.rename(columns={
    'level_0':'y',
    'level_1':'x',
    0:'ID'
},inplace=True)
draw_korea = korea_stacked.copy()
draw_korea.head()

   y   x      ID
0  0   7      철원
1  0   8      화천
2  0   9      양구
3  0  10  고성(강원)
4  1   3      양주

In [35]:
tmp_set = set(bugger_index.ID) - set(draw_korea['ID'])
tmp_set

{'안산', '창원'}

In [37]:
for tmp in tmp_set:
    bugger_index = bugger_index.drop(bugger_index[bugger_index.ID==tmp].index)

## 행이 삭제되었으니 좌표, ID DF draw_korea을 인구 DF pop과 합친다.
- how='left'로 하면 Coffeeindex에 맞추게 되어 없는 구들은 제외되어 나오지 않는다.
- 고유 ID 만들 때 나왔던 도시들이 이디야 커피가 있음에도 불구하고 누락되어 있음
- 검토해 본 결과 저 4개 대기업 카페는 하나도 나오지 않고 개인카페들만 있는 지역들이었음

In [29]:
cf = pd.merge(buggerpop, draw_korea, how='outer',  on = 'ID')
cf = cf.fillna(0)
cf.tail(15)

        ID  버거킹  맥도날드  롯데리아  KFC  맘스터치  버거지수      인구수계     y     x
237     영덕  0.0   0.0   0.0  0.0   0.0   0.0   33715.0   7.0  11.0
238     영양  0.0   0.0   0.0  0.0   0.0   0.0   15272.0   9.0  11.0
239     청송  0.0   0.0   0.0  0.0   0.0   0.0   23031.0  10.0  11.0
240     칠곡  0.0   0.0   0.0  0.0   0.0   0.0  108254.0  12.0   9.0
241  인천 동구  0.0   0.0   0.0  0.0   0.0   0.0   60791.0   6.0   2.0
242     신안  0.0   0.0   0.0  0.0   0.0   0.0   33248.0  21.0   0.0
243     영광  0.0   0.0   0.0  0.0   0.0   0.0   46722.0  19.0   1.0
244     장흥  0.0   0.0   0.0  0.0   0.0   0.0   34009.0  24.0   2.0
245     진도  0.0   0.0   0.0  0.0   0.0   0.0   26956.0  24.0   0.0
246     화순  0.0   0.0   0.0  0.0   0.0   0.0   55338.0  21.0   4.0
247     임실  0.0   0.0   0.0  0.0   0.0   0.0   25064.0  19.0   4.0
248     청양  0.0   0.0   0.0  0.0   0.0   0.0   28735.0  13.0   3.0
249     태안  0.0   0.0   0.0  0.0   0.0   0.0   57081.0  11.0   0.0
250     단양  0.0   0.0   0.0  0.0   0.0   0.0   26478.0  11.0   7.0
251     영동  0.0   0.0   0.0  0.0   0.0   0.0   44563.0  15.0   7.0

In [ ]:
## 창원, 안산

In [38]:
cf[cf.ID == '창원']

     ID  버거킹  맥도날드  롯데리아  KFC  맘스터치  버거지수  인구수계    y    x
162  창원  0.0   1.0   1.0  0.0   0.0   1.0   0.0  0.0  0.0

In [30]:
cf.to_csv('./result/전국 버거 지수(인구포함).csv',sep=',',encoding='utf8')